#https://ivtipm.github.io/Programming/Glava03/index03.htm#z64
#Дано натуральное число n (n > 99). 
#Определить число сотен в нем.

__author__ = 'Borisova Ekaterina IVT20'

n =int(input ("Введите число больше 99: "))

print(f"В {n} количество сотен равно {n // 100} ")

