#https://ivtipm.github.io/Programming/Glava06/index06.htm#z136
#Даны натуральное число n, действительные числа a1,..., an. Вычислить: д) a1^2 + ... + an^2;

__author__ ="Borisova Ekaterina IVT20"

import ar5

n =int(input ("Введите количество элементов в массиве: "))

a = (ar5.ar_filling(a, n))

print(a)
print(ar5.calc(a,n))
